results/routeA/initialization_check/A-Ra1e5-medium/0/gh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      gh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
6400
(
-0.008802816901408451
-0.008802816901408451
-0.008802816901408451
-0.008802816901408451
-0.008802816901408448
-0.008802816901408451
-0.008802816901408451
-0.008802816901408449
...
)
;

boundaryField
{
    hotWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
80
(
-0.008802816901408451
-0.02640845070422534
-0.04401408450704224
-0.06161971830985916
-0.07922535211267606
-0.09683098591549295
-0.1144366197183099
-0.1320422535211267
...
)
;
    }
    coldWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
80
(
-0.008802816901408451
-0.02640845070422535
-0.04401408450704224
-0.06161971830985916
-0.07922535211267606
-0.09683098591549295
-0.1144366197183099
-0.1320422535211267
...
)
;
    }
    bottomWall
    {
        type            calculated;
        value           uniform 0;
    }
    topWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
80
(
-1.408450704225352
-1.408450704225352
-1.408450704225352
-1.408450704225352
-1.408450704225352
-1.408450704225352
-1.408450704225352
-1.408450704225352
...
)
;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //
