results/routeA/initialization_check/A-Ra1e5-medium/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
6400
(
-0.008802816901408451
-0.008802816901408451
-0.008802816901408451
-0.008802816901408451
-0.008802816901408451
-0.008802816901408451
-0.008802816901408451
-0.008802816901408451
...
)
;

boundaryField
{
    hotWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
80
(
-0.008798415492957746
-0.02639524647887324
-0.04399207746478873
-0.06158890845070422
-0.07918573943661972
-0.09678257042253521
-0.1143794014084507
-0.1319762323943662
...
)
;
    }
    coldWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
80
(
-0.008807218309859154
-0.02642165492957747
-0.04403609154929577
-0.06165052816901408
-0.07926496478873239
-0.09687940140845071
-0.114493838028169
-0.1321082746478873
...
)
;
    }
    bottomWall
    {
        type            calculated;
        value           uniform 0;
    }
    topWall
    {
        type            calculated;
        value           uniform -1.408450704225352;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //
