results/routeA/initialization_check/A-Ra1e5-medium/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
6400
(
0
0
0
0
-3.469446951953614e-18
0
0
-1.734723475976807e-18
...
)
;

boundaryField
{
    hotWall
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           nonuniform List<scalar> 
80
(
1.734723475976807e-18
-6.938893903907228e-18
-6.938893903907228e-18
6.938893903907228e-18
1.387778780781446e-17
0
1.387778780781446e-17
-2.775557561562891e-17
...
)
;
    }
    coldWall
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           nonuniform List<scalar> 
80
(
0
-3.469446951953614e-18
-1.387778780781446e-17
0
0
-1.387778780781446e-17
0
-5.551115123125783e-17
...
)
;
    }
    bottomWall
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 0;
    }
    topWall
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           nonuniform List<scalar> 
80
(
0
0
2.220446049250313e-16
0
2.220446049250313e-16
0
2.220446049250313e-16
0
...
)
;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //
